
print("----------------------------------------")
print("             🌸МЕНЮ КАФЕ🌸")
print("----------------------------------------")
print('')
print("1. Кофе☕ - 120 рублей")
print("2. Чай🍵 - 80 рублей")
print("3. Сок🧃 - 100 рублей")
print("4. Вода🫗 - 50 рублей")
print("5. Лимонад🍹 - 90 рублей")

# Выбор напитка
drink_input = input("Введите номер или название напитка: ").lower()

match drink_input:
    case "1"|'кофе':
        drink_name = "Кофе☕"
        price = 120
        quantity = int(input("Введите количество порций: "))
        if quantity < 1:
            print("Ошибка: некорректное количество позиций")
            exit()
        else:
            discount = input("Введите код скидки: ").lower()
    case "2"|'чай':
        drink_name = "Чай🍵"
        price = 80
        quantity = int(input("Введите количество порций: "))
        if quantity < 1:
            print("Ошибка: некорректное количество позиций")
            exit()
        else:
            discount = input("Введите код скидки: ").lower()
    case "3"|'сок':
        drink_name = "Сок🧃"
        price = 100
        quantity = int(input("Введите количество порций: "))
        if quantity < 1:
            print("Ошибка: некорректное количество позиций")
            exit()
        else:
            discount = input("Введите код скидки: ").lower()
    case "4"|"вода":
        drink_name = "Вода🫗"
        price = 50
        quantity = int(input("Введите количество порций: "))
        if quantity < 1:
            print("Ошибка: некорректное количество позиций")
            exit()
        else:
            discount = input("Введите код скидки: ").lower()
    case "5"|'лимонад':
        drink_name = "Лимонад🍹"
        price = 90
        quantity = int(input("Введите количество порций: "))
        if quantity < 1:
            print("Ошибка: некорректное количество позиций")
            exit()
        else:
            discount = input("Введите код скидки: ").lower()
    case _:
        print("Ошибка! Такого напитка в меню нет")
        exit()


total = price * quantity

# Чек
print('')
print("***************************************")
print("              ✨ВАШ ЗАКАЗ✨")
print("***************************************")
print('')
print(f"Выбранный напиток: {drink_name}")
print(f"Цена: {price} рублей")
print(f"Количество: {quantity} ")
print(f"Сумма: {total} рублей")

if discount == 'student':
    print(f'Применен скидочный код: {discount} ')
    total_price=total*0.8
else:
    total_price=total

print('')
print(f"Итого к оплате: {total_price} ")